---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.TreadDepthTooBigFailure
source: html/f0ac1ddc-3ffc-84a2-7af4-8cd6928613c9.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.TreadDepthTooBigFailure Property

The tread depth is too large for the spiral run.

## Syntax (C#)
```csharp
public static FailureDefinitionId TreadDepthTooBigFailure { get; }
```